// В небольшом городе численность населения p0 = 1000на начало года. Население регулярно увеличивается на 2 percentгод, 
// причем 50каждый год в город приезжают новые жители. Сколько лет нужно городу, 
// чтобы его население превысило или сравнялось с p = 1200жителями?
// Более общие параметры:

// p0, percent, aug (inhabitants coming or leaving each year), p (population to equal or surpass)

// функция  nb_yearдолжна возвращать nколичество целых лет, необходимых для получения численности населения, большей или равной p.

// aug — целое число, процент — положительное или нулевое плавающее число, p0 и p — положительные целые числа (> 0)

// nb_year(1500, 5, 100, 5000) -> 15
// nb_year(1500000, 2.5, 10000, 2000000) -> 10
// Не забудьте преобразовать процентный параметр в процентное значение в теле вашей функции: если процентный параметр равен 2, вам необходимо преобразовать его в 0,02.

// Нет никаких фракций людей. В конце каждого года численность населения представляет собой целое число: 252.8число людей округляется до 252числа человек.

function nbYear(p0, percent, aug, p) {
   let years = 0;
   while(p0 < p){
    p0 = Math.floor((p0 * (1 + percent / 100)) + aug);
    years++;
   }
   return years
}

console.log(nbYear(1500, 5, 100, 5000));