// Если вы не можете уснуть, просто считайте овец!
// Задав целое неотрицательное число, например, 3, вернуть строку с бормотанием: "1 овца... 2 овцы... 3 овцы...". 
// Входные данные всегда должны быть корректными, т.е. не содержать отрицательных целых чисел.

// var countSheep = function (num){
//     let str = '';
//     for(let i = 1; i <= num; i++){
//       str += `${i} sheep...`
//     }
//     return str
// }

const countSheep = (num) => [...Array(num)].map((item, i) => `${i + 1} sheep...`).join('')

console.log(countSheep(4));